app/controllers/fabrics_controller.rb

SELECT "fabrics".* FROM "fabrics"
---
  def index
    @fabrics = Fabric.all

INSERT INTO "fabrics" ("name", "reference", "observation", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["reference", ""], ["observation", ""], ["created_at", "2020-03-03 22:38:16.602767"], ["updated_at", "2020-03-03 22:38:16.602767"]]
---
  def create
    @fabric = Fabric.new(fabric_params)

    respond_to do |format|
      if @fabric.save

UPDATE "fabrics" SET "name" = ?, "reference" = ?, "observation" = ?, "updated_at" = ? WHERE "fabrics"."id" = ?  [["name", "teste"], ["reference", "teste"], ["observation", "555"], ["updated_at", "2020-03-03 22:38:43.364253"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @fabric.update(fabric_params)

DELETE FROM "fabrics" WHERE "fabrics"."id" = ?  [["id", 1]]
---
  def destroy
    @fabric.destroy

SELECT "fabrics".* FROM "fabrics" WHERE "fabrics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_fabric
      @fabric = Fabric.find(params[:id])