app/controllers/fabric_variant_suppliers_controller.rb

  def index
    @fabric_variant_suppliers = FabricVariantSupplier.all
---
SELECT "fabric_variant_suppliers".* FROM "fabric_variant_suppliers"

  def create
    @fabric_variant_supplier = FabricVariantSupplier.new(fabric_variant_supplier_params)

    respond_to do |format|
      if @fabric_variant_supplier.save
---
INSERT INTO "fabric_variant_suppliers" ("price_cents", "price_currency", "price_unit", "min_purchase", "fabric_variant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @fabric_variant_supplier.update(fabric_variant_supplier_params)
---
UPDATE "fabric_variant_suppliers" SET "price_unit" = ?, "updated_at" = ? WHERE "fabric_variant_suppliers"."id" = ?  [["price_unit", "25"], ["updated_at", "2020-03-04 05:07:35.234179"], ["id", 1]]

  def destroy
    @fabric_variant_supplier.destroy
---
DELETE FROM "fabric_variant_suppliers" WHERE "fabric_variant_suppliers"."id" = ?  [["id", 1]]

    def set_fabric_variant_supplier
      @fabric_variant_supplier = FabricVariantSupplier.find(params[:id])
---
SELECT "fabric_variant_suppliers".* FROM "fabric_variant_suppliers" WHERE "fabric_variant_suppliers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]