app/controllers/fabric_variants_controller.rb

SELECT "fabric_variants".* FROM "fabric_variants"
---
  def index
    @fabric_variants = FabricVariant.all

INSERT INTO "fabric_variants" ("name", "reference", "observation", "composition", "grammage", "width", "fabric_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @fabric_variant = FabricVariant.new(fabric_variant_params)

    respond_to do |format|
      if @fabric_variant.save

UPDATE "fabric_variants" SET "observation" = ?, "updated_at" = ? WHERE "fabric_variants"."id" = ?  [["observation", "ffffff"], ["updated_at", "2020-03-04 05:06:46.520100"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @fabric_variant.update(fabric_variant_params)

DELETE FROM "fabric_variants" WHERE "fabric_variants"."id" = ?  [["id", 1]]
---
  def destroy
    @fabric_variant.destroy

SELECT "fabric_variants".* FROM "fabric_variants" WHERE "fabric_variants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_fabric_variant
      @fabric_variant = FabricVariant.find(params[:id])